Pandas Concat 1

In [1]:
import pandas as pd

In [2]:
sr1 = pd.Series([0,1,2])
sr1

0    0
1    1
2    2
dtype: int64

In [3]:
sr2 = pd.Series([3,4,5])
sr2

0    3
1    4
2    5
dtype: int64

In [4]:
pd.concat([sr1,sr2])

0    0
1    1
2    2
0    3
1    4
2    5
dtype: int64

In [7]:
df1 = pd.DataFrame({
    'ID':[1,2,3,4],
    'Name':['A','B','C','D'],
    'Class':[5,6,7,8]})
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [8]:
df2 = pd.DataFrame({
    'ID':[5,6,7,8],
    'Name':['E','F','G','H'],
    'Class':[9,10,11,12]})
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [9]:
pd.concat([df1,df2])

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12

In [10]:
pd.concat([df2,df1],axis=1)

   ID Name  Class  ID Name  Class
0   5    E      9   1    A      5
1   6    F     10   2    B      6
2   7    G     11   3    C      7
3   8    H     12   4    D      8

In [12]:
pd.concat([df2,df1],axis=1,ignore_index=True)

   0  1   2  3  4  5
0  5  E   9  1  A  5
1  6  F  10  2  B  6
2  7  G  11  3  C  7
3  8  H  12  4  D  8